# C4.5 Нелинейные структуры данных: графы и деревья
# Графы

G = {
    "Адмиралтейская":
        {"Садовая": 4},

    "Садовая":
        {"Сенная площадь": 4,
         "Спасская": 3,
         "Адмиралтейская": 4,
         "Звенигородская": 5},
    "Сенная площадь":
        {"Садовая": 4,
         "Спасская": 4},
    "Спасская":
        {"Садовая": 3,
         "Сенная площадь": 4,
         "Достоевская": 6},

    "Достоевская":
        {"Владимирская": 3,
         "Спасская": 6},
    "Владимирская":
        {"Достоевская": 3,
         "Пушкинская": 4},

    "Пушкинская":
        {"Звенигородская": 3,
         "Владимирская": 4},
    "Звенигородская":
        {"Пушкинская": 3,
         "Садовая": 5}}

# При работе с графами одна из наиболее частых задач — поиск кратчайшего пути от одной вершины к другой.
# Сейчас мы с вами попытаемся реализовать алгоритм, позволяющий найти его.
# «Алгоритм Дейкстры».

D = {k: 100 for k in G.keys()}  # инициализация расстояний
start_k = list(D.keys())[0]  # стартовая вершина
D[start_k] = 0  # расстояние от нее до самой себя равно 0
U = {k: False for k in G.keys()}  # флаги просмотренных вершин

for _ in range(len(D)):
    # Выбираем среди не просмотренных вершин наименьшее по расстоянию
    min_k = min([k for k in U.keys() if not U[k]], key=lambda x: D[x])

    for v in G[min_k].keys():  # проходимся по всем смежным вершинам
        D[v] = min(D[v], D[min_k] + G[min_k][v])  # минимум

    U[min_k] = True  # просмотренную вершину помечаем

for key, value in D.items():
    print(f"{key}: {value}")

print(D)